app_version: 1.0.0
name: Azure Sentinel
description: Azure Sentinel Incidents
contact_info:
  name: "@pemontto"
  url: https://github.com/pemontto
  email: ""
tags:
  - SIEM
  - Ticketing
categories:
  - SIEM
  - Ticketing
authentication:
  required: true
  parameters:
    - name: tenant_id
      description: The tenant of the OAuth client
      example: "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"
      multiline: false
      required: true
      schema:
        type: string
    - name: client_id
      description: The client id to use
      example: "*****"
      multiline: false
      required: true
      schema:
        type: string
    - name: client_secret
      description: The secret key to use
      multiline: false
      example: "*****"
      required: true
      schema:
        type: string
    - name: subscription_id
      description: The subscription for Azure Sentinel
      multiline: false
      example: "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"
      required: true
      schema:
        type: string
    - name: resource_group_name
      description: The resource group for Azure Sentinel
      multiline: false
      example: "SentinelResourceGroupName"
      required: true
      schema:
        type: string
    - name: workspace_name
      description: The workspace name for Azure Sentinel
      multiline: false
      example: "SentinelWorkspace"
      required: true
      schema:
        type: string
actions:
  - name: get_incidents
    description: Get incidents
    parameters:
      # - name: severity
      #   description: Comma separated list of severities to be exported
      #   multiline: false
      #   example: "High,Medium,Low,Informational"
      #   required: false
      #   schema:
      #     type: string
      - name: status
        description: Comma separated list of statuses to be exported
        multiline: false
        example: "New,Active,Closed"
        # options:
        #   - New
        #   - Active
        #   - Closed
        required: false
        schema:
          type: string
      - name: last_modified
        description: Only get events modified since this time (UTC)
        multiline: false
        example: "2021-01-23T01:30:00"
        required: false
        schema:
          type: string
      # - name: lookback
      #   description: Export events modified after this time period (d=days, h=hours, m=minutes)
      #   multiline: false
      #   example: "6h"
      #   required: false
      #   schema:
      #     type: string
      - name: get_entities
        description: "Include incident entites in output (default: false)"
        multiline: false
        options:
          - True
          - False
        required: false
        schema:
          type: string
      - name: get_comments
        description: "Include incident comments in output (default: false)"
        multiline: false
        options:
          - True
          - False
        required: false
        schema:
          type: string
    returns:
      schema:
        type: string
  - name: get_incident
    description: Get incident
    parameters:
      - name: incident_id
        description: The incident ID to get
        multiline: false
        example: "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"
        required: true
        schema:
          type: string
      - name: get_entities
        description: "Include incident entites in output (default: false)"
        multiline: false
        options:
          - True
          - False
        required: false
        schema:
          type: string
      - name: get_comments
        description: "Include incident comments in output (default: false)"
        multiline: false
        options:
          - True
          - False
        required: false
        schema:
          type: string
    returns:
      schema:
        type: string
  - name: close_incident
    description: |
      Close an incident
    parameters:
      - name: incident_id
        description: The incident ID to close
        multiline: false
        example: "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"
        required: true
        schema:
          type: string
      - name: close_reason
        description: The close reason
        required: true
        multiline: false
        options:
          - Undetermined
          - TruePositive - SuspiciousActivity
          - BenignPositive - SuspiciousButExpected
          - FalsePositive - IncorrectAlertLogic
          - FalsePositive - InaccurateData
        schema:
          type: string
      - name: close_comment
        description: The close comment
        required: false
        multiline: false
        example: "Incident investigated!"
        schema:
          type: string
    returns:
      schema:
        type: string
  - name: update_incident
    description: |
      Update an incident
    parameters:
      - name: incident_id
        description: The incident ID to close
        multiline: false
        example: "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"
        required: true
        schema:
          type: string
      - name: severity
        description: The incident severity
        required: false
        multiline: false
        options:
          - None
          - Informational
          - Low
          - Medium
          - High
        schema:
          type: string
      - name: status
        description: The incident status
        required: false
        multiline: false
        options:
          - None
          - New
          - Active
        schema:
          type: string
      - name: owner
        description: The user principal name of the incident owner
        required: false
        multiline: false
        example: john.smith@example.com
        schema:
          type: string
    returns:
      schema:
        type: string
  - name: add_comment
    description: Add comment to incident
    parameters:
      - name: incident_id
        description: The incident ID to close
        multiline: false
        example: "1031"
        required: true
        schema:
          type: string
      - name: comment
        description: The comment to add
        multiline: false
        example: "This is an example comment"
        required: true
        schema:
          type: string
    returns:
      schema:
        type: string
  - name: run_query 
    description: Runs a KQL query in your tenant
    parameters:
      - name: query 
        description: The query to run
        multiline: true
        example: "SecurityEvent | where EventID == \"4688\" | where CommandLine contains \"-noni -ep bypass $\""
        required: true
        schema:
          type: string
      - name: query_category 
        description: The comment to add
        multiline: false
        example: "Hunting Queries"
        required: true
        schema:
          type: string
      - name: query_name 
        description: The name to use for the query 
        multiline: false
        example: "HuntingRule02"
        required: true
        schema:
          type: string
    returns:
    returns:
      schema:
        type: string
large_image: data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAK4AAACuCAIAAAAgbqG5AAAABGdBTUEAALGPC/xhBQAAACBjSFJNAAB6JgAAgIQAAPoAAACA6AAAdTAAAOpgAAA6mAAAF3CculE8AAAABmJLR0QA/wD/AP+gvaeTAAAACXBIWXMAAC4jAAAuIwF4pT92AAAAB3RJTUUH5gsEDQcTN1ywMwAAFuFJREFUeNrtnXmUVNWZwL9731JVr7au6uqteqGbBgRkB9lFJBADSpS4jBqd8XgMiYlnMsJJTMymozGZMS5zkhyTSWaSmHESkyhGE0fRuGQhiuICGFahu+mG3qu6tldvu9/8US8q2FRVN11dVc39yeF4mte33nv1e3f97vcIIgKHA0CLfQKcUoGrwLHhKnBsuAocG64Cx4arwLHhKnBsuAocG64Cx4arwLHhKnBsuAocG64Cx4arwLHhKnBsuAocG64Cx4arwLHhKnBsuAocG64Cx4arwLHhKnBsuAocG64Cx4arwLHhKnBsuAocG64Cx4arwLHhKnBsuAocG64Cx4arwLHhKgAA8BxEACAW+wTGCUSIa1ZPXO+M6l1RvSeuD6pWIm1pFsuIIFDidggBl1DplsJ+ubFCDvvlgCKKlBT73MeJCa4CIvTE9Z0diZcOxXZ1JtoGtcGUqZrMYni6qoBQIgvE7xTq/fLsWuX8Vt/Kyb7WkFMSJrgTZKJmaEOEw/3qr94ceGz3wP5eVdUZEABKREoESkQKAiGEACEn/YqFaDEwGZoWIkNAEARS75M/MtV/3aKq5S1epzRhm9SJqcLxIf2nO3t/urP3cH8aAQSRukTikqhDpJJABAqEkGGfcQRABIZoMdRMVA2mGswwERlWKOLGGYFbVtUtanJTMgFriImmgmay378T+c6Lx3d2JCxEWaI+p+CWBVkgmUY//6slAAhgMlQNFktbKZ2hhQ0V8uZlNZuX19Z4pWJf6xgzoVQ43Je+/6Xjj+zqi2mWKFK/U/A5hTNv4wkAQ0jqVkS1VJ0JAKtafV9Z13DBFN9E6lROEBVSOtu2e+DfX+jacyIFlLgdNOgSx7ZdJwAmw6G0FVUt02RVbulTy2o+u6K2vkIu9tWP0QWWuwoM8a3O5AMvndi2dzCpW5JEAy7R5xQK97imDdadMHQDKcDiRs/WC8MbZgYUuey7k2WsAiIc6lN//nrfw6/1dUQ1QonHIQQVwSEW9luxGHYO6ZqJAAAMPbJw8czAZ1bULGv2FvqjC0pZqqBbuK879eu3Bn711sDhARWBOCQScIleh1Dorj0BiGvsREw/6a4xrFTE9TMC1y+qWtbs9TqFYt+hUV1aGalgMjw+pL9yNP7U3yIvHho6HtMRQJKozyn4ncK49eB64sZQ2jr1pwiA6HMKS5o8l8wMrpnmbw05XWU1CVHqKpgWRlTz6ID2Vldyx9HYK+2JtoimGQwokUXidQhepyCP4zygybAzquvW6W8aQ0pInU9aWO8+v9V3XpNnSpUr5BZLv+0oFRUQ7RG8arCoavYljI5B7WBfen+verBX7YhqEdViDIGCKFCnRD0yVWQ6zmM5AhBLW91xI/ctQwBEAuB1CvU+eVqVa0aN65xqV3Olo8YrBxVRkalTpCIlpTNZVTQV+hLGc/uj/SkzkjKjKTOWtiKqOZA0I6oZUc2YZiV1ZmUePgKEEkkgTpG6ZOqSqCQQWozlRATojhlxzRrhryEwAAICJS6J+h1CUBGDihhySwFF8DtFr1MIuESPg86r9yxodI/7ZdkUbTlqf4/6uceORNPWSV8pASBACKGUiAJxylQWiCxSh0AkgQiUkL8bUBR/TQvTBhvxrxECAgCABZAwWEJnXTH9pGsg9iXdtqb+bFQBARgAUOKWqUgJJUSgkPk7s2IkEKCZFaMP3LQiNmYEIGUwg53xKRCAYVsFhqyojXUxF6kRQKCkyiNl+n3k5H8a9v+LCENIjrRpGClF7TcUP17hvcsvka/8dOgWps0SP8czovgqjD+IgABo//c+BOzF62Hr75RhmWfeOpQwZ4sKDIEhEgBJIG6H4HUIPqfgdQiyQARKGIJpYdKwYmkrrllxzdJMzBxPKbFXJrWRdxjLigmuAkNkCC6J1vnkaSHnjBplashZ75cDiqhI1CnRTM8UEBigbqJqsJhm9cT0o4Pa33rUA31qe0SLpa2UbqVNrkIZggAWQ4dAp4Scy5u9yyZ5Z9S4Qm4pa+wCcYrgcwo1XmlqyLlyMjCEeNo6Mph+/VjimX3RFw8NRVQTMkOaichEUyEjgdchLG7ybJwZXDLJU+WWRjejRwn4XcL8evf8evfV80NvdiYff3vgqXcibRGNQZF7+4VgQqlgMVRk4YLJvivnVp7X5BnD1SCvQ1jV6lvR4v3Mitr/3dX389f72iLaBKshJogKiAAEFjV6blxcvWqyr0BxyQIl02tcd6xvump+6Pt/OvHLNweiaRMmSkzbRFDBYhhUpOsXha6dX1XpLvgVUQKz6pQHP9GyYWbg7u2dr3UmsHTWlM6AslfBQpwXdm9ZHV46yTOeMekOkW6cFZxb7/72c50/fb1PNbHcG4tSX0TPAgIQgI/PDP7Hppblzd6i7E1oCji+c1nLvRsnVSsilPkEVLnWCoggCuSGRVU3r6j1OooZQKbI9OaVtWGf/IUn298dTJdv16EsawVEkEVy87Kaf15VV1wPMlBCNs2t/NHVredUucq3bii/WgEBRIFsXlqzeVmtQxzlI6iZLKmzhGZpJloMKQFZpIpMPbLglOjoHuwLp/ofunLypx9999BAWdYN5acCAfjHhVWbl9WM1APDwmNR7Z1udW936lCf2pc0h9KmZiIiEkJESrwOGlDE5oBzVq1rdp0yudLpGWGVc+FU/wObWjY/+u7xhFF2vcgyU8FiuPHc4GdX1DpHEjUaVc0dbfHtB6JvdCZ7k4ZhIUBmfuikrmZvArA/vbMj8dhu4nMKTRWOlc3ejbMCrSFn/n3SDTMD/7q+8dbftsUze7fLh3JSwWI4J+zesqrOl/dGg6G09ez+yG/eHnynJ5U2GSWEEjhdcCyB99enh9LW9gPRJ/YMPvSX7ivmVt6wpHpalSsfHwiB68+rPtCr3vfyifJavyobFRAhqIhbLwg3Bhz5HG8x/Gt74kev9OzsiBsWCpSMKDzaZKhZiAQOD6b/7YWux/cM3rKy9p8WV+djoSySrWvq3+xKPn9oqIw6DeU0gvjkgqplzd58joylrYd29Nz626N/PhpjCCPdQEkAUjqzA1UIQUoO9qtfeLLtpl8c3nsilU8JNV7pax9trPPKpR6b9QHKQwWL4byw+9oFoXy+064h/evPdHz3zyeGVGt0GyUyW+hP+hEhGsKvdw9c+/DBZ/ZF8glHXdnq27y0ujzuLwCUhQoI4JLoDYurqjy5s1u0DWpf/n377/4WgdPEpeWDbrHhwxgp2dOduumX7z7+9kBOGyiBm5bXzA8r5TLTUAYqWAxXtPhWt/pzHtkR0b7yfx072uJnuKU+qTPrdN8fJV0x/fOPH922eyBnOQ0Vjs3La8sln1epq4AAblm4el5lzgQGgynz2y90vdJ+ph4whKSete9PSVdc3/pE28uHh3KWduns4MJ6T1lUDKWuAmO4sMF9XlOO3qJh4X/+tef5g0Mj7Rwg/v0PAAAQAM1kWs4wRkraotptT7YfGUhnP7DGK12zIDTK+cvxpdRVECm5eEbAnatKeOHQ0C/f6s+zzMxWXYuhJBCfU6hwCX6noEgUAQyGcc3K6xmm5NVjiXuf78q5de6ScwNTgg4ojW3KWSjpeQWG0Bxw5BxA9sSNH/61J6FZOZuGTORjhVOcXacsafLMqHFVeSRJIAwhoVlHB7U3OpNPvzMYT6kWYO5uJyH/80b/2nMqLp9XmeWo5krnumkVB3d0l/jkY4mrgEsmecK+HHmvHts9sLc7ldMDhqhIwtpp/qvnhWbVKR+OfFzU6Ll8TvDTy2q27R748Ss9+3pUzF4mgYRuffdPJ1ZN8WUZ3VACH5tZ8ZPXelNWSVcMJd1AOAS6ssWX/eHsiGjb9gxirqkci+HkoPNbFzfds6EpSwQsJaQ56Lh1dXjbjdOvX1glk1z79yjZ0R5/cs9g9k9f2OiZEnKWeOexdFVgCNVeaWaNK/thzx8aao9o2ZeLLIZzw+77L23eMCOQZ/aTadWu710x+Ytr6l0iyW6DYeEju/qiqpnlmGqvtKjRU+Izj6WsAk4NObMnTR1KW8/si2bfi24xnF7t+uaGpnNrlRGdgNcp3L6u4ZYVtTkWwyl57Vjy1bZElkMEQpZM8pDSHkeUrgoAML3alf0h3teTOtivZhmqIUKFS9y6Ojy9OkftMiwuid62tmHD9IrsdXtCt57dH8le1Kw6t7+0M7cVTQXyfrKR4REpaa10Zi/ktY5EQrOyPGsIuGl2cNVk36jPs9It3ra2IefC0o62+EAyWxvRUCFXucUcQ8qitiBFU8ElUZESxOFzQWXWHRqy5szVTLb7RCrL3WMIdV75yrmVZzj/uHiS59JZgWzfIiHvDmhtg9mmmwKKWO/L6hNCcaeoi6aCxyE4RfreXvdTbwuC1yGE3Nk6ChHV6sjaYWSIK1t8U0I5qpaciJRcOS+ULVKBQDRtHuhVsxSiSLS+wpFNBQJBdzGzyRdNBZ9TqHAKgGANP1mHikSzTzL2J43BlJnlOZIEMlb7I+aElWmhbNHMpoVH+rUsJQiUVGddWRUpqc1j6bVwFG2KyecUqrwS9KqnSWVCNAtfPBw7nQ2UwP5eNWWw033RiBBwiVOrzrRKyBBQxFl1yuvHsg0TdrTHH32zH2H4Jp9ScmxIy/LoOSRa5y9mEvmiqaDItCXofPlwzLCGaYQpge6Y/vVnO7IVgdlbXgy4xKAyNhcoUNIcdGSbOabkmQPR7Qej2c4XTx9DgRBwCuGzUwVKyDnVTiCgWwyHm+8/3eOVJ4jglMgYptP1O4XsiwgIMPqZZcR6v1zcN88Uc17h3FrFKVHNxAKluxrbQi0s5GAPYXq1K/9I7kJQVBXqlLBPNi3ULRzzURQhJKmx1CiSr56GwZRZOBUIJUuavQV8n0keFFOFsE+eVasAw9QY5Eg9FQIQUc2+hDEmpRkWvtunnnk5w4MQVMRFDZ5ClZ8fxVTBKdE1U/1AiZollnC0EAIxzdrXMzbfX2/C2NutFupuIc6qdZ2Ta+Gt0BR5DWJVq6/GI6ZNpplj30ZYDP94JJY7Oi0PdrbHjwymRx9DnYs1U/zF7ShA0VWYXuNa2uQFCxP62Md1CIS80h7ffTyvTSxZUA32i1396th1O04CocotXTS9oiCFj4Qiq+CS6GWzg6JIkjozxloGQiCqmo+80TeazP0fYPv+6LMHo4WqEhCXN3tn1xct9/97FH+Reu05/hlVLsNgiQLkVaeUPH9o6Im9g6Mu4Uh/+p7nOmNpq0CRibJAL58bVErgLVPFP4OGCseV8yoBIKaNfT5tAqCZ+L0/d7+Ux56FD9MbN27/XfvOzkShdsEynBdWPjo9UJDCR0jxVQCAK+aFJgedmoGJAqTUpgR6Evod2zufOxgdkWkdEe3zjx/9ze7BwvUWBUquWRAqkddbl4QK06tdV8+vBMShtFmImUdKSNeQ/pWnOx7a0Z09wCSDbuH2/dFrHz746NsDVuFmfRjOrVOumBcq2AeMjFJ5o9zBXvXjP9p/YECt9EiVY7SGdAqZlY65Yfflc4LLm711PvmUrVQIEFPNNzuTj+zq37ZnYCBV2EytIsCDlzV/7vy6wn3EiCgVFQDg3j90fenpDkpJvV8edb6tnFgMRUoUic6sVmbXKQ0VsschGBb2J4wDfequY8k93anoOGR4Z7i61ferG87JZ3v4+FBCKnTH9Ct+cuAvbXGfItZ4RpmuPR90Czsjmmli5oV/AiWZrXPIEAiMT54Ur0QfvnbKZXMqz7yosaIk+goZan3yravDXocQT1sJvVAv7CIAqsFMBBAIUGIB6AwNRCT2T8bjUhleMafyYzNKYuDwHiWkAgBccm7g2vkhZDiYNMd8xinDeLwYLtcZTAs5t1wYLlB6+lFTWmfjEOmWC8OzaxXNYAOpgoQxFP3FcC6Rbr0wPKtuZPtzxoHSUgEAplW7bl/X4HUIsbQVS4/941vkF8MxvGpe5XWLqot2Aqen5FQAgE/MqbxxcTVhOJgyx3YRCHNmVCkoDOfWKbeva8iZQaYolOI5ySL5wkfq10zxmybrS4xlp0GzmJbHa+YLAkKlIt75saZpo9qyNw6UogoAUO+X7764aXLQkdat/uSY1egpnVlFGjxLFLZcEL5kVmmNGj5IiaoAAEubvXetb6pwivG0NZgag55e7nxbhYPhdQuqbllVV9zoxeyUrgoAcNWC0NbVdTKFSMocUs+oC5lvvq1CwHBNq//O9Y1Fj1PKTkmrIFLyL6vDNy6uJggDSSN+BvMBCJDUWRGGDgxn1yr3XdacZ2rqIlLSKgCAxyHcsb7p0pkBy8K+hDnqGt5imBr/1gGxqcJx36XN8xqKH6SUk1JXAQBqvNJ9m5rXTfWbJutNGKMYXhKAtImaNb4qIFQr0n2XNq8rgbjFfCgDFQCgpdL5wKaWJY0ew2A98RHbgABJfXyHDggVDvrNDU2fmFtCC07ZKQ8VAODcOuX7V06eV+fWDdYTN0YUuWqOc+uA4JXpHRc13rC0uoRHDKdSNioAwMJGz0NXTZ5Tq+gG6867bsgsRRZocWsY/u7BzefXje4VBMWinFQAgKXN3h9c1ZqxoSdu5LMlMjN2GCcREHwSvfOixltW1cllkvD9PcpMBQBY1uL94T+0zg/bLUXOMYVhoTo+rQOCX6Z3ri9LD6AcVQCApc3e/7pmyrImb6YXmWW+wW4dxqFSQKx0Cd/eOOlz59eVywsgTqEsVQCA+Q3uH1/Tum6a3zRZb9yIqsP3BRiMy2Qzw7BXfvCylk8tqylTD6CkYhtHQdugtmXb0d++E0ECQUUMKKd21HQLO6N6YQMUGLYGnfdf1rxxVrAYb0gfM8pbBQDoiRvfeLrjJ6/16gx8LiHkFt/TgQBEVKt3jFIsDA/DBfXuBza1rGodfZbQEqHsVQCAeNr6zotdD7x0Im5YikOockuZ2HlEOB7TC9dAEIZrp/rv39RSgtFpo7mcCaACAOgW/uzV3m8803EibjhkGnJLbplqJuuMGgWZZUSQCHxyQeiuiydlTzlbRkwQFQCAIWzfF7ntqfbd3SlBoJVu0WI4kMq9LW7EIPodwpYLwp+/IOx3lfS684iYOCpk2HM89aWn2p85EEUChBTgZRwMWwKOuzY0XTU/VL6DhWGZaCoAQE/c+NZznT9+tSdpsLHdBE0Ynt/iu+eSphVnkEq+ZJmAKgCAarBHXu+7a3tnR1Qbmw1PCC6BXLew6msXNZR+EMromJgqAAAi7Dga++rTHX88EmcAZ7QXlmG9T/7y2vobltTkfM1h+TJhVcjQNaTf+4eu/361N65bo6keECjAqhbvnRuaVk72ldVC44iZ4CoAgGay37w1cPf2zv196shsYOhzCjctqdl6Ybi4ibjHh4mvQoa9J1J3b+98Yu+gZmFejQXDOXXKVz/aeOmsoFywZA8lxdmiAgDE0tbPdvbe99Lx9kjWviTDzAvRv7i2flpVie5kKgRnkQoAgAi7jiXuea7z6X1RjX1oqIlAEM+tUW77SP3l8ypdJbbpvdCcXSpkGFLNR17vf/Dl44cG0u9XDwx9DuHaBaEtq8NTS3VbY0E5G1UAAAR450TqvheP//rtgaRuCYQsbvJ8cU14/cx8X0878ThLVcigGuzxtwd+8Jfu8yf7bllVdzYME7JwVqsAAIgQUU2vQ5hgCwqj4GxXgfMeZ2m7yPkwXAWODVeBY8NV4NhwFTg2XAWODVeBY8NV4NhwFTg2XAWODVeBY8NV4NhwFTg2XAWODVeBY8NV4NhwFTg2XAWODVeBY8NV4NhwFTg2XAWODVeBY8NV4NhwFTg2XAWODVeBY8NV4NhwFTg2XAWODVeBY/P/hk+UdGKBjjgAAAAldEVYdGRhdGU6Y3JlYXRlADIwMjItMTEtMDRUMTI6MDc6MjIrMDE6MDA28WaeAAAAJXRFWHRkYXRlOm1vZGlmeQAyMDIyLTExLTA0VDEyOjA3OjE5KzAxOjAwyySNOwAAAABJRU5ErkJggg==
